package cote;

public class Cote {
    /*
        자료구조란?
        데이터를 저장하고 관리하는 방법론

        자료구조의 기본 작동방식
        1.Access(접근) : 특정 요소에 직접 정급하여 값을 읽거나 수정하는 작업을 말한다.
        2.Search(탐색) : 특정 값을 찾는 작업을 말한다.
        3.Insertion(삽입) : 새로운 요소를 추가하는 작업을 말한다.
        4.Deletion(삭제) : 특정 요소를 제거하는 작업을 말한다.

        빅오(Big O)표기법?
        알고리즘의 효율성을 결정하는 지표이다.
        입력 크기의 증가에 따라 코드가 실행되는데 걸리는 시간과 데이터의 공간이 얼마나 필요하게 되는지를 추정하는데 사용한다.

        시간 복잡도?
        입력 크기에 따라 알고리즘이 실행되는 데 걸리는 시간을 의미한다.

        공간 복잡도?
        알고리즘이 실행되는데 필요한 메모리 양을 의미한다.

        코딩 테스트는 수능과 같이 사람을 걸러내기 위한 용도이고,
        현업에서는 잘 사용하지는 않는다. 수능 문제가 평상시에 잘 사용하지 않는 것 처럼
    */
}
